In [1]:
import pandas as pd

In [2]:
people = {
    'fname':['alif','kunal','amir'],
    'lnam':['kamate','chavan','nadaf'],
    'email':['alif@gmail.com','kunal@gmail.com','amir@gmail.com']
}

In [3]:
df = pd.DataFrame(people)
df

   fname    lnam            email
0   alif  kamate   alif@gmail.com
1  kunal  chavan  kunal@gmail.com
2   amir   nadaf   amir@gmail.com

In [4]:
df.columns
#object referst to strings

Index(['fname', 'lnam', 'email'], dtype='object')

## first lets change the columns names

In [5]:
df.columns =['first_name','last_name','email']

In [6]:
df

  first_name last_name            email
0       alif    kamate   alif@gmail.com
1      kunal    chavan  kunal@gmail.com
2       amir     nadaf   amir@gmail.com

In [7]:
df.columns =[x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME            EMAIL
0       alif    kamate   alif@gmail.com
1      kunal    chavan  kunal@gmail.com
2       amir     nadaf   amir@gmail.com

In [8]:
df.columns = df.columns.str.replace('_'," ")
# make how it was before
df.columns = df.columns.str.replace(' ','_')

In [9]:
df

  FIRST_NAME LAST_NAME            EMAIL
0       alif    kamate   alif@gmail.com
1      kunal    chavan  kunal@gmail.com
2       amir     nadaf   amir@gmail.com

In [10]:
df.rename(columns={
    'FIRST_NAME' : 'first',
    'LAST_NAME' : 'last'
}, inplace=True)

In [11]:
df

   first    last            EMAIL
0   alif  kamate   alif@gmail.com
1  kunal  chavan  kunal@gmail.com
2   amir   nadaf   amir@gmail.com

 ## lets change a single value/ row

In [12]:
# select the row to update
df.loc[2] = ['alisha','nadaf','alisha@gmail.com']

In [13]:
df

    first    last             EMAIL
0    alif  kamate    alif@gmail.com
1   kunal  chavan   kunal@gmail.com
2  alisha   nadaf  alisha@gmail.com

In [14]:
## this is more reliable to use
df.loc[2,['last','EMAIL']] = ['kurkure','kurkure@gmail.com']

In [15]:
df.rename(columns={
    'EMAIL':'email'
}, inplace=True)

In [16]:
# lets change the first for the 2 index
df.loc[2,'first'] = 'layz'

we can also use the `at` instead of `.loc`

In [17]:
df.at[2,'first'] ='crazy'

wrong way to modifying the rows

In [18]:
filt = (df['email'] =='kurkure@gmail.com')
df[filt]['last'] = 'nadaf'

/tmp/ipykernel_11004/353143767.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'nadaf'

In [19]:
# modifying with the right way 
filt = (df['last'] == 'kurkure')
df.loc[filt,'last'] = 'nadaf'
df

   first    last              email
0   alif  kamate     alif@gmail.com
1  kunal  chavan    kunal@gmail.com
2  crazy   nadaf  kurkure@gmail.com

In [20]:
df['email'] = df['email'].str.lower()
df

   first    last              email
0   alif  kamate     alif@gmail.com
1  kunal  chavan    kunal@gmail.com
2  crazy   nadaf  kurkure@gmail.com

some methods where people get confused 
* apply
* map
* applymap
* replace

In [21]:
# apply can work with both series and dataframe as well

# first lets work with series
df['email'].apply(len)

0    14
1    15
2    17
Name: email, dtype: int64

In [22]:
def update_email(email):
    return email.upper()

df['email'].apply(update_email)

0       ALIF@GMAIL.COM
1      KUNAL@GMAIL.COM
2    KURKURE@GMAIL.COM
Name: email, dtype: object

In [23]:
#we can also do something like this 
# assign it back to the column to make changes permanant
df['email'] = df['email'].apply(lambda email: email.upper())
df

   first    last              email
0   alif  kamate     ALIF@GMAIL.COM
1  kunal  chavan    KUNAL@GMAIL.COM
2  crazy   nadaf  KURKURE@GMAIL.COM

In [24]:
df['email'] = df['email'].apply(lambda email: email.lower())

now lets see how `apply()` workd with dataframe

In [25]:
df.apply(len)
# it is giving the how many values inside the column name

first    3
last     3
email    3
dtype: int64

In [26]:
df.apply(len,axis='columns')
# now it is giving the 0 row has the 3 column values

0    3
1    3
2    3
dtype: int64

In [27]:
# cross checking
len(df['email'])

3

In [28]:
df.apply(pd.Series.min)

first              alif
last             chavan
email    alif@gmail.com
dtype: object

In [29]:
df.apply(lambda x: x.min()) # lambda works only on series

first              alif
last             chavan
email    alif@gmail.com
dtype: object

# applymap()

In [32]:
# df.applymap(len) # this is deprecated so avoid doing this
df.map(len)

   first  last  email
0      4     6     14
1      5     6     15
2      5     5     17

In [33]:
df.map(str.lower)

   first    last              email
0   alif  kamate     alif@gmail.com
1  kunal  chavan    kunal@gmail.com
2  crazy   nadaf  kurkure@gmail.com

# map()

In [34]:
df['first'].map({'alif':'robert','crazy':'amir'})

0    robert
1       NaN
2      amir
Name: first, dtype: object

In [40]:
df['first'] = df['first'].replace({'alif':'robert','crazy':'amir'})
df

    first    last              email
0  robert  kamate     alif@gmail.com
1   kunal  chavan    kunal@gmail.com
2    amir   nadaf  kurkure@gmail.com